AccumulationRegisters/ОборотыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоКатегориям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/НарушениеЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НарушениеЛимитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Превышение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СЛ_КонтрольСервер/Ext/Module.bsl
// Проверяет соблюдение месячного лимита расходов по категории пользователя при проведении документа. При превышении лимита формирует фоновое задание для записи нарушения, выводит сообщение пользователю и устанавливает отказ в проведении.
//
// Параметры:
//   Источник - ДокументСсылка - документ, который проводится
//   Отказ - Булево - признак отказа в проведении (возвращаемое значение)
//   РежимПроведения - РежимПроведенияДокумента - режим проведения документа
Процедура ПроверитьЛимитыПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОборотыПоКатегориям");
	ЭлементБлокировки.УстановитьЗначение("Категория",Источник.Категория);
	ЭлементБлокировки.УстановитьЗначение("Пользователь", Источник.Пользователь);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Лимит = ДБ_ОбщегоНазначенияСервер.ПолучитьЛимитКатегории(Источник.Категория);
	
	Если Лимит = 0 Тогда
		Возврат;
		КонецЕсли;
		ФактЗаМесяц = ДБ_ОбщегоНазначенияСервер.ПолучитьСуммуРасходаЗаМесяц(Источник.Категория, Источник.Пользователь);
		
	ОбщийРасход = ФактЗаМесяц + Источник.Сумма;
	
	Если ОбщийРасход > Лимит Тогда  
		 Превышение = ОбщийРасход - Лимит;
		ПараметрыФона = Новый Структура;
		ПараметрыФона.Вставить("Объект",   Источник.Ссылка);
    		ПараметрыФона.Вставить("Категория", Источник.Категория);
    		ПараметрыФона.Вставить("Лимит",     Лимит);
    		ПараметрыФона.Вставить("СуммаДокумента", Источник.Сумма);
    		ПараметрыФона.Вставить("Превышение", Превышение);
    		ПараметрыФона.Вставить("Пользователь", Источник.Пользователь); 
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрыФона);
		ФоновыеЗадания.Выполнить("СЛ_КонтрольСервер.ЗаписьНарушенияВФоне", МассивПараметров);
			               
		ОстатокДоступно = Лимит - ФактЗаМесяц; 
		Если ОстатокДоступно > 0 Тогда
			ТекстОшибки = СтрШаблон("Превышение лимита по категории '%1'! |Лимит месяца: %2 |Уже потрачено: %3 |Доступно: %4 |Вы пытаетесь провести: %5", 
			Источник.Категория, Лимит, ФактЗаМесяц, ОстатокДоступно, Источник.Сумма);
		Иначе  
			ТекстОшибки = СтрШаблон("Превышение лимита по категории '%1'! |Лимит месяца: %2 |Уже потрачено: %3 |Превышено: %4 |Вы пытаетесь провести: %5", 
			Источник.Категория, Лимит, ФактЗаМесяц, -(ОстатокДоступно), Источник.Сумма); 
		КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Источник.Ссылка, "Сумма",, Отказ);
	ЗаписьЖурналаРегистрации("Контроль.НарушениеЛимита",УровеньЖурналаРегистрации.Предупреждение,, Источник.Ссылка,ТекстОшибки);
	КонецЕсли;
КонецПроцедуры  

// Записывает нарушение лимитов в регистр сведений в фоновом режиме.
//
// Параметры:
//   СтруктураДанных - Структура - данные нарушения для записи в регистр
Процедура ЗаписьНарушенияВФоне(СтруктураДанных) Экспорт
	   МенеджерЗаписи = РегистрыСведений.НарушениеЛимитов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтруктураДанных);
		Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Контроль.ОшибкаФона",,,,ОписаниеОшибки());
		КонецПопытки;
КонецПроцедуры
